AccumulationRegisters/DMS_РекламныеКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>DMS_РекламныеКампании</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СуммаПланРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПланУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаФактРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаФактУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКампании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/DMS_РекламныеКампанииПредставителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_РекламныеКампанииПредставителей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_СтатусыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Представитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_СтатусыМакетовРекламныхКампаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СтатусыМакетовРекламныхКампаний</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СтатусыМакетовРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампании</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МакетРекламнойКампании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_МакетыРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_СтатусыОтчетовПоРекламнойКампании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СтатусыОтчетовПоРекламнойКампании</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DMS_СтатусыОтчетовПоРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.DMS_ОтчетПоРекламнойКампании</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РекламнаяКампания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_РекламнаяКампания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетПоКампании</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ОтчетПоРекламнойКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ПользовательскиеДанныеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ПользовательскиеДанныеСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДилерПодписантВЛице</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДилерПодписантНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДилерПодписантПодпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДилерПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемаПисьмаКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстПисьмаКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогинDU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантЗаписиЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантЗаписиЭлектронногоПисьма</Name>
			<Comment>Вариант записи электронного письма</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоместитьВПапкуИсходящие</Name>
					<Comment>После записи документа производится попытка поместить электронное письмо в папку "Исходящие"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьНемедленно</Name>
					<Comment>После записи документа, производится попытка отправки электронного письма</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыСообщений</Name>
			<Comment>Статусы  сообщений (например, электронного письма)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
					<Comment>Входящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
					<Comment>Исходящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправленное</Name>
					<Comment>Отправленное сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сохраненное</Name>
					<Comment>Сохраненное сообщение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КодГруппыАдресаЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КодГруппыАдресаЭлектронногоПисьма</Name>
			<Comment>Перечисление кодов группы адреса электронного письма</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кому</Name>
					<Comment>Кому</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копии</Name>
					<Comment>Копия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытыеКопии</Name>
					<Comment>Скрытая копия</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФорматТекста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФорматТекста</Name>
			<Comment>Тип текста HTML или Простой текст</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
					<Comment>Формат текста HTML </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
					<Comment>Текстовый формат </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/DMS_РекламныеКампанииСервер/Ext/Module.bsl
////#Область ПрограммныйИнтерфейс

Процедура ОтразитьРекламныеКампании(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаРекламныеКампании = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРекламныеКампании;
	
	Если Отказ ИЛИ ТаблицаРекламныеКампании.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРекламныеКампании = Движения.DMS_РекламныеКампании;
	ДвиженияРекламныеКампании.Записывать = Истина;
	ДвиженияРекламныеКампании.Загрузить(ТаблицаРекламныеКампании);
	
КонецПроцедуры

Процедура ОтразитьРекламныеКампанииПредставителей(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаРекламныеКампанииПредставителей = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРекламныеКампанииПредставителей;
	
	Если Отказ ИЛИ ТаблицаРекламныеКампанииПредставителей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРекламныеКампанииПредставителей = Движения.DMS_РекламныеКампанииПредставителей;
	ДвиженияРекламныеКампанииПредставителей.Записывать = Истина;
	ДвиженияРекламныеКампанииПредставителей.Загрузить(ТаблицаРекламныеКампанииПредставителей);
	
КонецПроцедуры

Процедура ОтразитьСтатусМакетаРекламнойКампании(Установил,Макет,ДатаСобытия,Статус,Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Установил", 		   Установил);
	Запрос.УстановитьПараметр("РекламнаяКампания", Макет.РекламнаяКампания);
	Запрос.УстановитьПараметр("Макет", 			   Макет);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыМакетовРекламныхКампаний.Период,
		|	СтатусыМакетовРекламныхКампаний.РекламнаяКампания,
		|	СтатусыМакетовРекламныхКампаний.МакетРекламнойКампании,
		|	СтатусыМакетовРекламныхКампаний.Статус,
		|	СтатусыМакетовРекламныхКампаний.Установил
		|ИЗ
		|	РегистрСведений.DMS_СтатусыМакетовРекламныхКампаний КАК СтатусыМакетовРекламныхКампаний
		|ГДЕ
		|	СтатусыМакетовРекламныхКампаний.МакетРекламнойКампании = &Макет
		|	И СтатусыМакетовРекламныхКампаний.Установил = &Установил
		|	И СтатусыМакетовРекламныхКампаний.РекламнаяКампания = &РекламнаяКампания";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.DMS_СтатусыМакетовРекламныхКампаний.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РекламнаяКампания.Установить(Выборка.РекламнаяКампания);
		НаборЗаписей.Отбор.МакетРекламнойКампании.Установить(Выборка.МакетРекламнойКампании);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НаборЗаписей.Записать(Истина);
	
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.DMS_СтатусыМакетовРекламныхКампаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РекламнаяКампания.Установить(Макет.РекламнаяКампания);
	НаборЗаписей.Отбор.МакетРекламнойКампании.Установить(Макет);
	НаборЗаписей.Отбор.Период.Установить(ДатаСобытия);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.РекламнаяКампания = Макет.РекламнаяКампания;
	НоваяЗапись.МакетРекламнойКампании = Макет;
	НоваяЗапись.Период 			  = ДатаСобытия;
	НоваяЗапись.Статус 			  = Статус;
	НоваяЗапись.Установил 		  = Установил;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		
		Если ТипЗнч(Установил) = Тип("Строка") Тогда
			Возврат;
		КонецЕсли; 
		
		ЗаписьЖурналаРегистрации("Запись статуса макета рекламной кампании",УровеньЖурналаРегистрации.Ошибка,,Установил,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтразитьСтатусОтчетаПоРекламнойКампании(Установил,Отчет,ДатаСобытия,Статус,Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Установил", 		   Установил);
	Запрос.УстановитьПараметр("РекламнаяКампания", Отчет.РекламнаяКампания);
	Запрос.УстановитьПараметр("ОтчетПоКампании",   Отчет);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыОтчетовПоРекламнойКампании.Период,
		|	СтатусыОтчетовПоРекламнойКампании.РекламнаяКампания,
		|	СтатусыОтчетовПоРекламнойКампании.Статус,
		|	СтатусыОтчетовПоРекламнойКампании.Установил,
		|	СтатусыОтчетовПоРекламнойКампании.ОтчетПоКампании
		|ИЗ
		|	РегистрСведений.DMS_СтатусыОтчетовПоРекламнойКампании КАК СтатусыОтчетовПоРекламнойКампании
		|ГДЕ
		|	СтатусыОтчетовПоРекламнойКампании.РекламнаяКампания = &РекламнаяКампания
		|	И СтатусыОтчетовПоРекламнойКампании.Установил = &Установил
		|	И СтатусыОтчетовПоРекламнойКампании.ОтчетПоКампании = &ОтчетПоКампании";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.DMS_СтатусыОтчетовПоРекламнойКампании.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РекламнаяКампания.Установить(Выборка.РекламнаяКампания);
		НаборЗаписей.Отбор.ОтчетПоКампании.Установить(Выборка.ОтчетПоКампании);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НаборЗаписей.Записать(Истина);
	
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.DMS_СтатусыОтчетовПоРекламнойКампании.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РекламнаяКампания.Установить(Отчет.РекламнаяКампания);
	НаборЗаписей.Отбор.ОтчетПоКампании.Установить(Отчет);
	НаборЗаписей.Отбор.Период.Установить(ДатаСобытия);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.РекламнаяКампания = Отчет.РекламнаяКампания;
	НоваяЗапись.ОтчетПоКампании	  = Отчет;
	НоваяЗапись.Период 			  = ДатаСобытия;
	НоваяЗапись.Статус 			  = Статус;
	НоваяЗапись.Установил 		  = Установил;
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Отказ = Истина;
		ЗаписьЖурналаРегистрации("Запись статуса отчета по рекламной кампании",УровеньЖурналаРегистрации.Ошибка,,Установил,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура УсловноеОформлениеСпискаМакетовРекламнойКампании(Форма) Экспорт

	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыМакетов.Ссылка КАК Статус
		|ИЗ
		|	Справочник.DMS_СтатусыМакетовРекламнойКампании КАК СтатусыМакетов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Статус
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтатусов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		
		Статус = ВыборкаСтатусов.Статус;
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекущийСтатус.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТекущийСтатус");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = ВыборкаСтатусов.Статус;
		
		ЦветФона   = Статус.ЦветФона.Получить();
		ЦветТекста = Статус.ЦветТекста.Получить();
		Шрифт	   = Статус.ШрифтТекста.Получить();
		
		Если ЦветТекста <> Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
		КонецЕсли; 
		
		Если ЦветФона <> Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		КонецЕсли; 
		
		Если Шрифт <> Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);
		КонецЕсли; 
		
	КонецЦикла;
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДилерскийЦентр.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ДилерскийЦентр");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Для всех>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Для каждого ТекущийЭлемент Из Элементы.Список.ПодчиненныеЭлементы Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ТекущийЭлемент.Имя);
	КонецЦикла; 
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", 	 ШрифтыСтиля.DMS_УдаленныйДополнительныйРеквизитШрифт);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекущийСтатус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТекущийСтатус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.DMS_СтатусыМакетовРекламнойКампании.БезДействия;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Без действия");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекущийСтатус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТекущийСтатус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.DMS_СтатусыМакетовРекламнойКампании.ВАрхиве;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "В архиве");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекущийСтатус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТекущийСтатус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Справочники.DMS_СтатусыМакетовРекламнойКампании.ВАрхиве);
	СписокСтатусов.Добавить(Справочники.DMS_СтатусыМакетовРекламнойКампании.БезДействия);
	
	ОтборЭлемента.ПравоеЗначение = СписокСтатусов;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Удален");
	
КонецПроцедуры

Процедура УсловноеОформлениеСпискаОтчетовРекламнойКампании(Форма) Экспорт

	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыОтчетов.Ссылка КАК Статус
		|ИЗ
		|	Справочник.DMS_СтатусыОтчетовПоРекламнойКампании КАК СтатусыОтчетов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Статус
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтатусов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		
		Статус = ВыборкаСтатусов.Статус;
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекущийСтатус.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТекущийСтатус");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = ВыборкаСтатусов.Статус;
		
		ЦветФона   = Статус.ЦветФона.Получить();
		ЦветТекста = Статус.ЦветТекста.Получить();
		Шрифт	   = Статус.ШрифтТекста.Получить();
		
		Если ЦветТекста <> Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
		КонецЕсли; 
		
		Если ЦветФона <> Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		КонецЕсли; 
		
		Если Шрифт <> Неопределено Тогда
			Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);
		КонецЕсли; 
		
	КонецЦикла;
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДилерскийЦентр.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ДилерскийЦентр");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Для всех>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	Для каждого ТекущийЭлемент Из Элементы.Список.ПодчиненныеЭлементы Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ТекущийЭлемент.Имя);
	КонецЦикла; 
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", 	 ШрифтыСтиля.DMS_УдаленныйДополнительныйРеквизитШрифт);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекущийСтатус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТекущийСтатус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.БезДействия;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Без действия");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекущийСтатус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТекущийСтатус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.ВАрхиве;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "В архиве");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТекущийСтатус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ТекущийСтатус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.ВАрхиве);
	СписокСтатусов.Добавить(Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.БезДействия);
	
	ОтборЭлемента.ПравоеЗначение = СписокСтатусов;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Удален");
	
КонецПроцедуры

Процедура УсловноеОформлениеСпискаРекламныеКампании(Форма) Экспорт

	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
		
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДилерскийЦентр.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.ДилерскийЦентр");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      "<Для всех>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.DMS_ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры

////#КонецОбласти

////#Область РегламентныеЗадания

Процедура УстановкаСтатусаБезДействия() Экспорт
		
	УстановкаСтатусаБезДействияМакетам();
	
	УстановкаСтатусаБезДействияОтчетам();
	
КонецПроцедуры

Процедура УстановкаСтатусаБезДействияМакетам()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыМакетов.Период,
		|	СтатусыМакетов.РекламнаяКампания КАК РекламнаяКампания,
		|	СтатусыМакетов.МакетРекламнойКампании КАК МакетРекламнойКампании,
		|	СтатусыМакетов.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.DMS_СтатусыМакетовРекламныхКампаний.СрезПоследних КАК СтатусыМакетов
		|ГДЕ
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СтатусыМакетов.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ) > 3
		|	И СтатусыМакетов.Статус <> ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.Согласован)
		|	И СтатусыМакетов.Статус <> ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.БезДействия)
		|			И СтатусыМакетов.Статус <> ЗНАЧЕНИЕ(Справочник.DMS_СтатусыМакетовРекламнойКампании.ВАрхиве)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РекламнаяКампания,
		|	МакетРекламнойКампании,
		|	Статус
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтатусов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		
		Отказ = Ложь;
		
		Попытка
			ОтразитьСтатусМакетаРекламнойКампании("Регламентное задание",ВыборкаСтатусов.МакетРекламнойКампании,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыМакетовРекламнойКампании.БезДействия,Отказ);		
		Исключение
			
			КодОсновногоЯзыка  = DMS_ОбменДаннымиСДМСервер.КодОсновногоЯзыка(); // Для записи события в журнал регистрации.
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка статуса <Без действия>'", КодОсновногоЯзыка),
				УровеньЖурналаРегистрации.Ошибка,,ВыборкаСтатусов.МакетРекламнойКампании,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			Продолжить;	
			
		КонецПопытки;
		
		КодОсновногоЯзыка  = DMS_ОбменДаннымиСДМСервер.КодОсновногоЯзыка(); // Для записи события в журнал регистрации.
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка статуса <Без действия>'", КодОсновногоЯзыка),
			УровеньЖурналаРегистрации.Информация,,ВыборкаСтатусов.МакетРекламнойКампании,"Выполнено успешно");
			
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановкаСтатусаБезДействияОтчетам()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусыОтчетов.Период,
		|	СтатусыОтчетов.РекламнаяКампания КАК РекламнаяКампания,
		|	СтатусыОтчетов.Статус КАК Статус,
		|	СтатусыОтчетов.ОтчетПоКампании КАК ОтчетПоКампании
		|ИЗ
		|	РегистрСведений.DMS_СтатусыОтчетовПоРекламнойКампании.СрезПоследних(, ) КАК СтатусыОтчетов
		|ГДЕ
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СтатусыОтчетов.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ) > 3
		|	И СтатусыОтчетов.Статус <> ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.Согласован)
		|	И СтатусыОтчетов.Статус <> ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.БезДействия)
		|			И СтатусыОтчетов.Статус <> ЗНАЧЕНИЕ(Справочник.DMS_СтатусыОтчетовПоРекламнойКампании.ВАрхиве)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РекламнаяКампания,
		|	ОтчетПоКампании,
		|	Статус
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтатусов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаСтатусов.Следующий() Цикл
		
		Отказ = Ложь;
		
		Попытка
			ОтразитьСтатусОтчетаПоРекламнойКампании("Регламентное задание",ВыборкаСтатусов.ОтчетПоКампании,ТекущаяДатаСеанса(),Справочники.DMS_СтатусыОтчетовПоРекламнойКампании.БезДействия,Отказ);		
		Исключение
			
			КодОсновногоЯзыка  = DMS_ОбменДаннымиСДМСервер.КодОсновногоЯзыка(); // Для записи события в журнал регистрации.
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка статуса <Без действия>'", КодОсновногоЯзыка),
				УровеньЖурналаРегистрации.Ошибка,,ВыборкаСтатусов.ОтчетПоКампании,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			Продолжить;	
			
		КонецПопытки;
		
		КодОсновногоЯзыка  = DMS_ОбменДаннымиСДМСервер.КодОсновногоЯзыка(); // Для записи события в журнал регистрации.
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка статуса <Без действия>'", КодОсновногоЯзыка),
			УровеньЖурналаРегистрации.Информация,,ВыборкаСтатусов.ОтчетПоКампании,"Выполнено успешно");
			
	КонецЦикла;
	
КонецПроцедуры
 
////#КонецОбласти

////#Область УведомленияОСтатусах

Процедура СформироватьУведомлениеИсполнителяОНовойЗадаче(Задача,Предмет = Неопределено) Экспорт 

	мЭлектронноеПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	мЭлектронноеПисьмо.Важность 	 = Перечисления.ВариантЗаписиЭлектронногоПисьма.ПоместитьВПапкуИсходящие;
	мЭлектронноеПисьмо.СтатусПисьма  = Перечисления.СтатусыСообщений.Исходящее;
	мЭлектронноеПисьмо.Автор 		 = Задача.Автор;
	мЭлектронноеПисьмо.УчетнаяЗапись = ПолучитьПерсональнуюУчетнуюЗаписьПользователя(Задача.Автор);
	мЭлектронноеПисьмо.Дата			 = ТекущаяДатаСеанса();
	
	Если Не ЗначениеЗаполнено(мЭлектронноеПисьмо.УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли; 
	
	НоваяСтрока = мЭлектронноеПисьмо.Получатели.Добавить();
	НоваяСтрока.АдресЭлектроннойПочты = ПолучитьEMailПолучателя(Задача.Исполнитель);
	НоваяСтрока.Представление 		  = СокрЛП(Задача.Исполнитель.Наименование);
	НоваяСтрока.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
	
	мЭлектронноеПисьмо.ПолучателиПредставление = мЭлектронноеПисьмо.ПредставлениеПолучателей();

	мЭлектронноеПисьмо.ОтправительПредставление = ПолучитьПредставлениеДляУчетнойЗаписи(мЭлектронноеПисьмо.УчетнаяЗапись);
	
	мЭлектронноеПисьмо.Тема = СокрЛП(Задача.БизнесПроцесс);
	
	мЭлектронноеПисьмо.ТекстПисьма = СокрЛП(Задача.Наименование);
	
	мЭлектронноеПисьмо.ДатаОтправления = ТекущаяДатаСеанса();
	мЭлектронноеПисьмо.ПодразделениеКомпании = Задача.Автор.Подразделение;
	мЭлектронноеПисьмо.УстановитьНовыйНомер();
	мЭлектронноеПисьмо.Записать(РежимЗаписиДокумента.Запись);
	мЭлектронноеПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст;
	
	СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
	СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(мЭлектронноеПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
	Если СоединениеСПочтовымСервером <> Неопределено Тогда
		Если эпОтправитьПисьмо(мЭлектронноеПисьмо, СоединениеСПочтовымСервером) Тогда
			эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
		Иначе
			эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПредставлениеДляУчетнойЗаписи(УчетнаяЗапись)

	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Пользователь,
	|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка = &УчетнаяЗапись";
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Представление = СокрЛП(Выборка.Пользователь);
	Если ПустаяСтрока(Представление) Тогда
		Возврат Выборка.АдресЭлектроннойПочты;
	Иначе
		Возврат Представление + " <" + Выборка.АдресЭлектроннойПочты + ">";
	КонецЕсли;

КонецФункции

Функция ПолучитьПерсональнуюУчетнуюЗаписьПользователя(Пользователь)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Пользователь.Сотрудник);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
		|	CRM_ПользовательскиеДанныеСотрудников.УчетнаяЗаписьПочты КАК УчетнаяЗапись
		|ИЗ
		|	РегистрСведений.CRM_ПользовательскиеДанныеСотрудников КАК CRM_ПользовательскиеДанныеСотрудников
		|ГДЕ
		|	CRM_ПользовательскиеДанныеСотрудников.Сотрудник = &Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		УчетнаяЗапись = ВыборкаДетальныеЗаписи.УчетнаяЗапись;	
	КонецЕсли; 
	
	Возврат УчетнаяЗапись;
	
КонецФункции // ПолучитьПерсональнуюУчетнуюЗаписьПользователя()

Функция ПолучитьEMailПолучателя(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Пользователь.Сотрудник);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Представление КАК EMail_Получателя
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	EMail_Получателя = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		EMail_Получателя = СокрЛП(ВыборкаДетальныеЗаписи.EMail_Получателя);
	
	КонецЕсли; 
	
	Возврат EMail_Получателя;
	
КонецФункции // ПолучитьEMailПолучателя()
 

////#КонецОбласти

// См. одноименную функцию в общем модуле ПользователиКлиентСервер.
Функция ТекущийПользователь() Экспорт
	
	Возврат DMS_РекламныеКампанииКлиентСервер.ТекущийПользователь();
	
КонецФункции

Функция ЭтоПолноправныйПользователь() Экспорт 

	Возврат РольДоступна("ПолныеПрава");

КонецФункции // ЭтоПолноправныйПользователь()
 
// Процедура инициализирует общие структуры, используемые при проведении документов.
// Вызывается из модуля документов при проведении.
//
Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства, РежимПроведения = Неопределено) Экспорт

	// В структуре "ДополнительныеСвойства" создаются свойства с ключами "ТаблицыДляДвижений", "ДляПроведения".

	// "ТаблицыДляДвижений" - структура, которая будет содержать таблицы значений с данными для выполнения движений.
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);

	// "ДляПроведения" - структура, содержащая свойства и реквизиты документа, необходимые для проведения.
	ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	
	// Структура, содержащая ключ с именем "МенеджерВременныхТаблиц", в значении которого хранится менеджер временных таблиц.
	// Содержит для каждой временной таблицы ключ (имя временной таблицы) и значение (признак наличия записей во временной таблице).
	ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц));
	ДополнительныеСвойства.ДляПроведения.Вставить("РежимПроведения",           РежимПроведения);
	ДополнительныеСвойства.ДляПроведения.Вставить("МетаданныеДокумента",       ДокументСсылка.Метаданные());
	ДополнительныеСвойства.ДляПроведения.Вставить("Ссылка",                    ДокументСсылка);

КонецПроцедуры

Процедура ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства) Экспорт

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();

КонецПроцедуры

// Функция формирует массив имен регистров, по которым документ имеет движения.
// Вызывается при подготовке записей к регистрации движений.
//
Функция ПолучитьМассивИспользуемыхРегистров(Регистратор, Движения, МассивИсключаемыхРегистров = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Результат = Новый Массив;
	МаксимумТаблицВЗапросе = 256;

	СчетчикТаблиц   = 0;
	СчетчикДвижений = 0;

	ВсегоДвижений = Движения.Количество();
	ТекстЗапроса  = "";
	Для Каждого Движение Из Движения Цикл

		СчетчикДвижений = СчетчикДвижений + 1;

		ПропуститьРегистр = МассивИсключаемыхРегистров <> Неопределено
							И МассивИсключаемыхРегистров.Найти(Движение.Имя) <> Неопределено;

		Если Не ПропуститьРегистр Тогда

			Если СчетчикТаблиц > 0 Тогда

				ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ
				|";

			КонецЕсли;

			СчетчикТаблиц = СчетчикТаблиц + 1;

			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|""" + Движение.Имя + """ КАК ИмяРегистра
			|
			|ИЗ " + Движение.ПолноеИмя() + "
			|
			|ГДЕ Регистратор = &Регистратор
			|";

		КонецЕсли;

		Если СчетчикТаблиц = МаксимумТаблицВЗапросе Или СчетчикДвижений = ВсегоДвижений Тогда

			Запрос.Текст  = ТекстЗапроса;
			ТекстЗапроса  = "";
			СчетчикТаблиц = 0;

			Если Результат.Количество() = 0 Тогда

				Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");

			Иначе

				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Результат.Добавить(Выборка.ИмяРегистра);
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Процедура выполняет пордготовку наборов записей документа к записи движений.
// 1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте)
// 2. Взводит флаг записи у наборов, по которым документ имеет движения
// Вызывается из модуля документов при проведении.
//
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(Объект, ЭтоНовый = Ложь) Экспорт
	Перем ЭтоНовыйДокумент, МетаданныеДвижения;
	
	Для Каждого НаборЗаписей Из Объект.Движения Цикл

		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;

	КонецЦикла;
	
	Если НЕ Объект.ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовыйДокумент) Тогда
		ЭтоНовыйДокумент = ЭтоНовый;
	КонецЕсли;
	
	Если НЕ ЭтоНовыйДокумент Тогда

		// Регистры, движения по которым формируются не из модуля менеджера документа.
		ИсключаемыеРегистры = Новый Массив;
		
		// Регистры, движения по которым формируются не из модуля менеджера документа,
		// но должны удаляться при отмене проведения документа.
		Если Объект.ДополнительныеСвойства.Свойство("РежимЗаписи")
			И НЕ Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			
			
		КонецЕсли;
		
		Если Объект.ДополнительныеСвойства.Свойство("ДляПроведения")
		 И Объект.ДополнительныеСвойства.ДляПроведения.Свойство("МетаданныеДокумента") Тогда
			МетаданныеДвижения = Объект.ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Движения;
		Иначе
			МетаданныеДвижения = Объект.Метаданные().Движения;
		КонецЕсли;
		
		МассивИменРегистров = ПолучитьМассивИспользуемыхРегистров(
			Объект.Ссылка,
			МетаданныеДвижения,
			ИсключаемыеРегистры);

		Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
			Объект.Движения[ИмяРегистра].Записывать = Истина;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

// Процедура записывает движения документа. Дополнительно происходит копирование параметров
// в модули наборов записей для выполнения регистрации изменений в движениях.
// Процедура вызывается из модуля документов при проведении.
//
Процедура ЗаписатьНаборыЗаписей(Объект) Экспорт
	
	Перем РегистрыДляКонтроля;

	//Для отработки случаев, когда документ перестает делать движения по регистру (при изменении вида операции). Очистим оффлайновые регистры.
	Если Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Объект.ДополнительныеСвойства.ЭтоНовый Тогда
		
	КонецЕсли;
	
	Объект.Движения.Записать();
	
КонецПроцедуры

// Процедура переписывает строки таблицы в указанные движения документа
//
// Параметры:
// 		Таблица - ТаблицаЗначений - Таблица, строки которой должны быть помещены в движения документа
// 		Движения - Элемент коллекции движений документа, набор записей регистра
// 		Отказ - Булево - Признак отказа выполнения транзакции
//
Процедура ОтразитьДвижения(Таблица, Движения, Отказ) Экспорт
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Записывать = Истина;
	Движения.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура очищает и записывает пустые движения по указанным регистрам
//
// Параметры:
// 		Движения - КоллекцияДвижений - Коллекция наборов записей регистров документа
// 		Регистры - Строка - Строка с именами регистров для очистки, перечисленными через запятую
//
Процедура ОчиститьЗаписатьДвижения(Движения, Регистры) Экспорт
	
	СтруктураРегистров = Новый Структура(Регистры);
	Для Каждого КлючИЗначение Из СтруктураРегистров Цикл
		Движения[КлючИЗначение.Ключ].Очистить();
		Движения[КлючИЗначение.Ключ].Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

// Процедура компонует текст запроса, выполняет запрос и выгружает результаты запроса в таблицы
//
// Параметры:
//	Запрос - Запрос - запрос, параметры которого предварительно установлены.
//	ТекстыЗапроса - Список значений - список значений, значениями которого являются блоки запроса,
//	                                  синонимами - имена таблиц в которые необходимо поместить
//	                                  результат выполнения каждого отдельного блока запроса.
//	Таблицы - Структура - структура в которую будут помещены полученные таблицы для движений.
//
Процедура ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, Таблицы) Экспорт

	// Формирование текст запроса.
	Запрос.Текст = "";
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Запрос.Текст = Запрос.Текст + ТекстЗапроса.Значение;
	КонецЦикла;

	// Выполнение запроса.
	Результат = Запрос.ВыполнитьПакет();

	// Помещение результатов запроса в таблицы
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл

		ИмяТаблицы = ТекстЗапроса.Представление;

		Если Не ПустаяСтрока(ИмяТаблицы) Тогда

			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			Таблицы.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура УстановитьРежимПроведения(ДокументОбъект, РежимЗаписи, РежимПроведения) Экспорт

	Если ДокументОбъект.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;

КонецПроцедуры
